package by.sveta.les01.main;

public class Seven {
	
	public static void main (String[] args) {
		/* Дан прямоугольник, ширина которого в 2 раза меньше длиныю
		   Найти площадь пряямоугольника */
		
		double w = 2.3;
		double l = 2 * w;
		
		double S = w * l;
		
		System.out.println("Площадь прямоугольника = " + S);
		
	     
		
			
	}

}
